1:WizQst1627C8
00000000

But if you're willing to help me, maybe we can get this done real quick? It can't be any harder than fighting a zombie, right?
00000001

Let's see, the assignment is called "Battle Tactics of the Undead." Huh... guess we'll be fighting <ITALICS>all</ITALICS> the zombies.
00000002

Normally, it says, we'd be granted access to the sealed caves... but, uh, that ship has sailed. The Undead are everywhere now.
00000003

I think the best way to do this is for both of us to fight everything on this list and compare notes. We'll have more reliable observations that way.
00000008

Fight Lost Souls, Skeletal Pirates, Rotting Fodder, and Field Guards and then meet me back here. 
00000009

This quest has multiple simultaneous objectives. You can see them all by opening your Quest Log and pressing the arrow keys on this quest.
00000010

Use these arrow keys to select objective you wish to complete first and the Quest Arrow will point you to it.
00000011

Hey, you're back! Can I see your notes?
00000012

Undead Weaknesses: "Life Magic and Soap," but they're resistant to "blades, rocks and rolled up newspapers."
00000013

I had pretty similar results. Let's call this study successfully reproduced. I'll take it to Headmaster Ambrose right away. Thanks, Wizard.
00000014

Lost Soul
